# Задача-1

x = 10
y = 17
z = x + y
print(z)

# Задача-2

a = int(input(' Введите свое число: '))
b = a + 2
print(b)

# Задача-3

user_age = int(input('Введите свой возраст: '))
if user_age >= 18:
    print('Доступ разрешен')
else:
    print('Извините, пользование данным ресурсом только с 18 лет')


